#!/bin/bash
#####################################################################
#演示文件的高效使用
#####################################################################
cnt=0
while [ $cnt -lt 100 ]
do
#random目录下有很多随即相关的结构
    cat /proc/sys/kernel/random/uuid| cksum | cut -f1 -d" "
    let cnt=cnt+1
#这种方法可以最后一次性的把缓冲内容写入文件，避免在循环体内写文件
done > result
echo "generator ok"
#####################################################################
while read text
do
    [ $text -gt 100000000 ] && [ $text -lt 999999999 ] && echo "$text is ok!"
done < result > temp 
echo "filter over!"
#####################################################################
